### Terraform Plan: `dev`
```
module.platform.data.aws_caller_identity.current: Reading...
module.platform.module.eks.aws_iam_role.cluster: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role]
module.platform.module.eks.aws_iam_policy.lb_controller: Refreshing state... [id=arn:aws:iam::936249129410:policy/platform-sre-demo-dev-eks-lb-controller]
module.platform.module.eks.aws_iam_role.node_group: Refreshing state... [id=platform-sre-demo-dev-eks-node-role]
module.platform.module.eks.aws_kms_key.eks: Refreshing state... [id=ca248d76-0f55-4f6c-8013-64eb4fe8c2f5]
module.platform.module.eks.data.aws_region.current: Reading...
module.platform.data.aws_region.current: Reading...
module.platform.module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/platform-sre-demo-dev/flow-logs]
module.platform.module.vpc.aws_iam_role.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role]
module.platform.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-05cf920ba166ca4d4]
module.platform.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.vpc.aws_vpc.this: Refreshing state... [id=vpc-081b2c533af96b693]
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=936249129410]
module.platform.module.eks.aws_kms_alias.eks: Refreshing state... [id=alias/platform-sre-demo-dev-eks-secrets]
module.platform.module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455838500000006]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455785600000005]
module.platform.module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455912300000007]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260305015455772600000003]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260305015456026500000008]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_vpc_controller: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260305015456030300000009]
module.platform.module.vpc.aws_iam_role_policy.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role:flow-logs-policy]
module.platform.module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0a8d63a96d3bc635a]
module.platform.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bea391b39cfb1ca3]
module.platform.module.vpc.aws_route_table.database: Refreshing state... [id=rtb-06828d18e4480eb9f]
module.platform.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-004a88ce4ac96fe75]
module.platform.module.eks.aws_security_group.cluster: Refreshing state... [id=sg-0850ca35df6b2edf7]
module.platform.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0527efd673fa6e980]
module.platform.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0debce813955a6d26]
module.platform.module.vpc.aws_flow_log.this: Refreshing state... [id=fl-0402ef0bfd82775e5]
module.platform.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00538bd90e1a655c6]
module.platform.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-05076878a06bbc99d]
module.platform.module.eks.aws_security_group.node: Refreshing state... [id=sg-0d2dd2bb5ad7eb035]
module.platform.module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0ea022c24b50b7d79]
module.platform.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0c86920ecc761e13e]
module.platform.module.vpc.aws_db_subnet_group.this: Refreshing state... [id=platform-sre-demo-dev-db-subnet-group]
module.platform.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-014665f758c356b4f]
module.platform.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0265f4eb938bfcc7a]
module.platform.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-015cb91eda7bd7cd5]
module.platform.module.eks.aws_eks_cluster.this: Refreshing state... [id=platform-sre-demo-dev-eks]
module.platform.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fd3aa42725612cf9]
module.platform.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb99911d921e0c7e]
module.platform.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03a7b4e3b7c8bc67c]
module.platform.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09a1934cfc4882210]
module.platform.module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=platform-sre-demo-dev-eks:kube-proxy]
module.platform.module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=platform-sre-demo-dev-eks:vpc-cni]
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster.this: Reading...
module.platform.module.eks.aws_eks_node_group.default: Refreshing state... [id=platform-sre-demo-dev-eks:platform-sre-demo-dev-eks-default]
data.aws_eks_cluster_auth.this: Read complete after 0s [id=platform-sre-demo-dev-eks]
module.platform.module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274]
module.platform.module.eks.aws_iam_role.lb_controller: Refreshing state... [id=platform-sre-demo-dev-eks-lb-controller]
module.platform.module.eks.aws_iam_role_policy_attachment.lb_controller: Refreshing state... [id=platform-sre-demo-dev-eks-lb-controller-20260305042632917400000001]
data.aws_eks_cluster.this: Read complete after 1s [id=platform-sre-demo-dev-eks]
module.platform.module.eks.aws_eks_addon.coredns: Refreshing state... [id=platform-sre-demo-dev-eks:coredns]
module.platform.module.eks.helm_release.lb_controller: Refreshing state... [id=aws-load-balancer-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.platform.module.eks.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.platform.module.eks.aws_eks_access_entry.node will be created
  + resource "aws_eks_access_entry" "node" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "platform-sre-demo-dev-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::936249129410:role/platform-sre-demo-dev-eks-node-role"
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
        }
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.platform.module.eks.aws_eks_cluster.this must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                           = "arn:aws:eks:us-east-1:936249129410:cluster/platform-sre-demo-dev-eks" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVWJvZU9NY0w2c0l3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TmpBek1EVXdNVFUxTlRGYUZ3MHpOakF6TURJd01qQXdOVEZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURPT0pYZ2p1Y3ZqOUVFQmdPbG1RTUhZWFZBMldsNEFna0xUNkdUTkorRTV5MVNPSjJJQXZuWmJMTXgKWjZLcWxLYXh0NHZCQzRHYnRjdW0rT2RUS1lpY3h4ejBWdGNadXY3NU9kR0FLMWtYVko5elZ6OXBVTGtEQmovegoyaWtuK3hBMDVGSUJ0S1VtUHFMQ0lBdENiOGVidjVSaDNCZWdjYitDUFh2VDEwTDJ5WnFCRm85SGtYR1d3QmJYCkN2SlUzNmxTZVc3bmhxRlR5RkRmNkR4NVVqbGkvWlVodE13VWhkWXkyOGNPR2M2RW5ic0lmd3Jyc2dOK2hQdEkKT203eDdQeWlUY3RSdS9zcEI0S3Rac0dPTEttb3N0SnJtYjkxUDBmZm91blpxdjBZLzhQbVFBcGQzR0V2V2owMwpzZElWeXlFQVA3Ujh3MkFVaDhBTmxmUzR2UXVwQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTNTE0MDM2MFh2QlRXelhVWUhBWEY3eEMzMytEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQW1PbkFuamtpVgpJaW92dzZFTWVHMmpGRzYyMkpURUZ6UFFMeU44VFMrbElKRFcweERtYXEzaGx1bFpNQlNUV1BOTGFWQUw4RHczClNHbmx2Y3lnMmVvL3hsLzdxVkozUTFTdlpuZW1uZVdwYTZuVjN0SW5SMjByazNhNWRCUm5sZWQwYVZlMU12VkIKbE9BZWdjKzRNajlERE9qTTlubFBBNHczSWxXOWExNnlsaFVQbVhraGgxTG5mQ3pkdHR1dUhCS2x1dXBBb0lJcgo2bHREZVhtSldiTVhXR2lwdmVGeitKWU1JdWRqTnNYWTdnUGxQVVZxWVZBSmFVTUFGb1U4b2loVHcxWXRHRUJyCjFLQzJWVnZaZC82dlhwU0tWRUt3dmR5Tnc3TDBtOFF2T28wWWdzS1VCa2dqTjkwZTAvUFpEM0I1amtOUDU3U0QKaCtWOWNqOTRDYU5lCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2026-03-05T01:55:16Z" -> (known after apply)
      ~ endpoint                      = "https://D2236B40F30E2B5FB43CD77D10EB1274.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "platform-sre-demo-dev-eks" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274"
                    },
                ]
            },
        ] -> (known after apply)
        name                          = "platform-sre-demo-dev-eks"
      ~ platform_version              = "eks.63" -> (known after apply)
      ~ status                        = "ACTIVE" -> (known after apply)
        tags                          = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
        # (5 unchanged attributes hidden)

      ~ access_config {
          ~ authentication_mode                         = "CONFIG_MAP" -> "API_AND_CONFIG_MAP"
          - bootstrap_cluster_creator_admin_permissions = true -> null # forces replacement
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-020cbd002eee671fc" -> (known after apply)
          ~ vpc_id                    = "vpc-081b2c533af96b693" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform.module.eks.aws_iam_openid_connect_provider.eks must be replaced
+/- resource "aws_iam_openid_connect_provider" "eks" {
      ~ arn             = "arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274" -> (known after apply)
      ~ id              = "arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274" -> (known after apply)
        tags            = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
      ~ url             = "oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.platform.module.eks.aws_iam_role.lb_controller will be updated in-place
  ~ resource "aws_iam_role" "lb_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D2236B40F30E2B5FB43CD77D10EB1274"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-sre-demo-dev-eks-lb-controller"
        name                  = "platform-sre-demo-dev-eks-lb-controller"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Error: Provider configuration: cannot load Kubernetes client config

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on main.tf line 80, in provider "kubernetes":
  80: provider "kubernetes" {

invalid configuration: default cluster has no server defined

Error: Kubernetes cluster unreachable: invalid configuration: default cluster has no server defined

  with module.platform.module.eks.helm_release.lb_controller,
  on ../../modules/eks/main.tf line 327, in resource "helm_release" "lb_controller":
 327: resource "helm_release" "lb_controller" {

::error::Terraform exited with code 1.

```
*Triggered by @ahalsey in b238c9955f57724e271aae1114e784e288d898da*